<a href="https://colab.research.google.com/github/adnanmohit/Career_Exploration/blob/main/Day3_Pandas_Basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [112]:
import pandas as pd
import numpy as np

In [113]:
###create and explore simple dataframe
data = {
    "Name": ["Adnan","Sara","Rahim","Maruf"],
    "Age": [24,19,26,23],
    "Marks":[56,89,87,78]
}

df=pd.DataFrame(data)
print(df)

    Name  Age  Marks
0  Adnan   24     56
1   Sara   19     89
2  Rahim   26     87
3  Maruf   23     78

In [114]:
###Explore data
print(df.head())
print(df.tail())
print(df.describe())
print(df.shape)
print(df.info())

    Name  Age  Marks
0  Adnan   24     56
1   Sara   19     89
2  Rahim   26     87
3  Maruf   23     78
    Name  Age  Marks
0  Adnan   24     56
1   Sara   19     89
2  Rahim   26     87
3  Maruf   23     78
            Age      Marks
count   4.00000   4.000000
mean   23.00000  77.500000
std     2.94392  15.110703
min    19.00000  56.000000
25%    22.00000  72.500000
50%    23.50000  82.500000
75%    24.50000  87.500000
max    26.00000  89.000000
(4, 3)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Marks   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes
None

In [115]:
print(df.head())

    Name  Age  Marks
0  Adnan   24     56
1   Sara   19     89
2  Rahim   26     87
3  Maruf   23     78

In [116]:
print(df.size)

12

In [117]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Marks   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes
None

In [103]:
print(df.describe())

            Age      Marks
count   4.00000   4.000000
mean   23.00000  77.500000
std     2.94392  15.110703
min    19.00000  56.000000
25%    22.00000  72.500000
50%    23.50000  82.500000
75%    24.50000  87.500000
max    26.00000  89.000000

In [104]:
print(df.tail())

    Name  Age  Marks
0  Adnan   24     56
1   Sara   19     89
2  Rahim   26     87
3  Maruf   23     78

In [105]:
###accessing data from dataframe
print(df["Name"]) #access single column
print(df[["Age","Marks"]])

0    Adnan
1     Sara
2    Rahim
3    Maruf
Name: Name, dtype: object
   Age  Marks
0   24     56
1   19     89
2   26     87
3   23     78

In [106]:
print(df.iloc[0])

Name     Adnan
Age         24
Marks       56
Name: 0, dtype: object

In [107]:
print(df.loc[2])

Name     Rahim
Age         26
Marks       87
Name: 2, dtype: object

In [108]:
### Adding columns
df["Grade"]= ["B","A+","A","A+"]
print(df)

df["Shift"]= ["Day","Day","Evening","Day"]
print(df)

    Name  Age  Marks Grade
0  Adnan   24     56     B
1   Sara   19     89    A+
2  Rahim   26     87     A
3  Maruf   23     78    A+
    Name  Age  Marks Grade    Shift
0  Adnan   24     56     B      Day
1   Sara   19     89    A+      Day
2  Rahim   26     87     A  Evening
3  Maruf   23     78    A+      Day

In [109]:
df["New Marks"] = df["Marks"] + 5
print(df)

    Name  Age  Marks Grade    Shift  New Marks
0  Adnan   24     56     B      Day         61
1   Sara   19     89    A+      Day         94
2  Rahim   26     87     A  Evening         92
3  Maruf   23     78    A+      Day         83

In [110]:
df["Greeting"] = "Hello " + df["Name"]

In [111]:
print(df)

    Name  Age  Marks Grade    Shift  New Marks     Greeting
0  Adnan   24     56     B      Day         61  Hello Adnan
1   Sara   19     89    A+      Day         94   Hello Sara
2  Rahim   26     87     A  Evening         92  Hello Rahim
3  Maruf   23     78    A+      Day         83  Hello Maruf

In [123]:
### filtering in df
print(df[df["Marks"]>80])

#sort ascending
print(df.sort_values("Marks"))

#sort descending
print(df.sort_values("Marks", ascending=False))

    Name  Age  Marks
1   Sara   19     89
2  Rahim   26     87
    Name  Age  Marks
0  Adnan   24     56
3  Maruf   23     78
2  Rahim   26     87
1   Sara   19     89
    Name  Age  Marks
1   Sara   19     89
2  Rahim   26     87
3  Maruf   23     78
0  Adnan   24     56